mixly/Mixly_Arduino/mixly_arduino/arduino/portable/packages/esp8266/hardware/esp8266/2.5.2/boards.txt
##############################################################
d1_mini.name=LOLIN(WEMOS) D1 R2 & mini
d1_mini.build.board=ESP8266_WEMOS_D1MINI
d1_mini.build.variant=d1_mini
d1_mini.upload.tool=esptool
d1_mini.upload.maximum_data_size=81920
d1_mini.upload.wait_for_upload_port=true
d1_mini.upload.erase_cmd=version
d1_mini.serial.disableDTR=true
d1_mini.serial.disableRTS=true
d1_mini.build.mcu=esp8266
d1_mini.build.core=esp8266
d1_mini.build.spiffs_pagesize=256
d1_mini.build.debug_port=
d1_mini.build.debug_level=
d1_mini.menu.xtal.80=80 MHz
d1_mini.menu.xtal.80.build.f_cpu=80000000L
d1_mini.menu.xtal.160=160 MHz
d1_mini.menu.xtal.160.build.f_cpu=160000000L
d1_mini.menu.vt.flash=Flash
d1_mini.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
d1_mini.menu.vt.heap=Heap
d1_mini.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
d1_mini.menu.vt.iram=IRAM
d1_mini.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
d1_mini.menu.exception.disabled=Disabled
d1_mini.menu.exception.disabled.build.exception_flags=-fno-exceptions
d1_mini.menu.exception.disabled.build.stdcpp_lib=-lstdc++
d1_mini.menu.exception.enabled=Enabled
d1_mini.menu.exception.enabled.build.exception_flags=-fexceptions
d1_mini.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
d1_mini.menu.ssl.all=All SSL ciphers (most compatible)
d1_mini.menu.ssl.all.build.sslflags=
d1_mini.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
d1_mini.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
d1_mini.upload.resetmethod=nodemcu
d1_mini.build.flash_mode=dio
d1_mini.build.flash_flags=-DFLASHMODE_DIO
d1_mini.build.flash_freq=40
d1_mini.menu.eesz.4M=4M (no SPIFFS)
d1_mini.menu.eesz.4M.build.flash_size=4M
d1_mini.menu.eesz.4M.build.flash_size_bytes=0x400000
d1_mini.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
d1_mini.menu.eesz.4M.build.spiffs_pagesize=256
d1_mini.menu.eesz.4M.upload.maximum_size=1044464
d1_mini.menu.eesz.4M.build.rfcal_addr=0x3FC000
d1_mini.menu.eesz.4M1M=4M (1M SPIFFS)
d1_mini.menu.eesz.4M1M.build.flash_size=4M
d1_mini.menu.eesz.4M1M.build.flash_size_bytes=0x400000
d1_mini.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
d1_mini.menu.eesz.4M1M.build.spiffs_pagesize=256
d1_mini.menu.eesz.4M1M.upload.maximum_size=1044464
d1_mini.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
d1_mini.menu.eesz.4M1M.build.spiffs_start=0x300000
d1_mini.menu.eesz.4M1M.build.spiffs_end=0x3FB000
d1_mini.menu.eesz.4M1M.build.spiffs_blocksize=8192
d1_mini.menu.eesz.4M2M=4M (2M SPIFFS)
d1_mini.menu.eesz.4M2M.build.flash_size=4M
d1_mini.menu.eesz.4M2M.build.flash_size_bytes=0x400000
d1_mini.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
d1_mini.menu.eesz.4M2M.build.spiffs_pagesize=256
d1_mini.menu.eesz.4M2M.upload.maximum_size=1044464
d1_mini.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
d1_mini.menu.eesz.4M2M.build.spiffs_start=0x200000
d1_mini.menu.eesz.4M2M.build.spiffs_end=0x3FB000
d1_mini.menu.eesz.4M2M.build.spiffs_blocksize=8192
d1_mini.menu.eesz.4M3M=4M (3M SPIFFS)
d1_mini.menu.eesz.4M3M.build.flash_size=4M
d1_mini.menu.eesz.4M3M.build.flash_size_bytes=0x400000
d1_mini.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
d1_mini.menu.eesz.4M3M.build.spiffs_pagesize=256
d1_mini.menu.eesz.4M3M.upload.maximum_size=1044464
d1_mini.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
d1_mini.menu.eesz.4M3M.build.spiffs_start=0x100000
d1_mini.menu.eesz.4M3M.build.spiffs_end=0x3FB000
d1_mini.menu.eesz.4M3M.build.spiffs_blocksize=8192
d1_mini.menu.ip.lm2f=v2 Lower Memory
d1_mini.menu.ip.lm2f.build.lwip_include=lwip2/include
d1_mini.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
d1_mini.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
d1_mini.menu.ip.hb2f=v2 Higher Bandwidth
d1_mini.menu.ip.hb2f.build.lwip_include=lwip2/include
d1_mini.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
d1_mini.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
d1_mini.menu.ip.lm2n=v2 Lower Memory (no features)
d1_mini.menu.ip.lm2n.build.lwip_include=lwip2/include
d1_mini.menu.ip.lm2n.build.lwip_lib=-llwip2-536
d1_mini.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
d1_mini.menu.ip.hb2n=v2 Higher Bandwidth (no features)
d1_mini.menu.ip.hb2n.build.lwip_include=lwip2/include
d1_mini.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
d1_mini.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
d1_mini.menu.ip.lm6f=v2 IPv6 Lower Memory
d1_mini.menu.ip.lm6f.build.lwip_include=lwip2/include
d1_mini.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
d1_mini.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
d1_mini.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
d1_mini.menu.ip.hb6f.build.lwip_include=lwip2/include
d1_mini.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
d1_mini.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
d1_mini.menu.ip.hb1=v1.4 Higher Bandwidth
d1_mini.menu.ip.hb1.build.lwip_lib=-llwip_gcc
d1_mini.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
d1_mini.menu.ip.src=v1.4 Compile from source
d1_mini.menu.ip.src.build.lwip_lib=-llwip_src
d1_mini.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
d1_mini.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
d1_mini.menu.dbg.Disabled=Disabled
d1_mini.menu.dbg.Disabled.build.debug_port=
d1_mini.menu.dbg.Serial=Serial
d1_mini.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
d1_mini.menu.dbg.Serial1=Serial1
d1_mini.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
d1_mini.menu.lvl.None____=None
d1_mini.menu.lvl.None____.build.debug_level=
d1_mini.menu.lvl.SSL=SSL
d1_mini.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
d1_mini.menu.lvl.TLS_MEM=TLS_MEM
d1_mini.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
d1_mini.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
d1_mini.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
d1_mini.menu.lvl.HTTP_SERVER=HTTP_SERVER
d1_mini.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
d1_mini.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
d1_mini.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
d1_mini.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
d1_mini.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
d1_mini.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
d1_mini.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
d1_mini.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
d1_mini.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
d1_mini.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
d1_mini.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
d1_mini.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
d1_mini.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
d1_mini.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
d1_mini.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
d1_mini.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
d1_mini.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
d1_mini.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
d1_mini.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
d1_mini.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini.menu.lvl.CORE=CORE
d1_mini.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
d1_mini.menu.lvl.WIFI=WIFI
d1_mini.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
d1_mini.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
d1_mini.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
d1_mini.menu.lvl.UPDATER=UPDATER
d1_mini.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
d1_mini.menu.lvl.OTA=OTA
d1_mini.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
d1_mini.menu.lvl.OOM=OOM
d1_mini.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
d1_mini.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
d1_mini.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
d1_mini.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
d1_mini.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
d1_mini.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
d1_mini.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
d1_mini.menu.wipe.none=Only Sketch
d1_mini.menu.wipe.none.upload.erase_cmd=version
d1_mini.menu.wipe.sdk=Sketch + WiFi Settings
d1_mini.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
d1_mini.menu.wipe.all=All Flash Contents
d1_mini.menu.wipe.all.upload.erase_cmd=erase_flash
d1_mini.menu.baud.921600=921600
d1_mini.menu.baud.921600.upload.speed=921600
d1_mini.menu.baud.9600=9600
d1_mini.menu.baud.9600.upload.speed=9600
d1_mini.menu.baud.57600=57600
d1_mini.menu.baud.57600.upload.speed=57600
d1_mini.menu.baud.115200=115200
d1_mini.menu.baud.115200.upload.speed=115200
d1_mini.menu.baud.230400.linux=230400
d1_mini.menu.baud.230400.macosx=230400
d1_mini.menu.baud.230400.upload.speed=230400
d1_mini.menu.baud.256000.windows=256000
d1_mini.menu.baud.256000.upload.speed=256000
d1_mini.menu.baud.460800.linux=460800
d1_mini.menu.baud.460800.macosx=460800
d1_mini.menu.baud.460800.upload.speed=460800
d1_mini.menu.baud.512000.windows=512000
d1_mini.menu.baud.512000.upload.speed=512000


